<a href="https://colab.research.google.com/github/Samplergithub769/Data-Science-Intern/blob/main/Pandas_Assignment_Day_10.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# <center>Pandas Assignment</center>

Import pandas and numpy with their aliases

In [1]:
import pandas as pd
import numpy as np

Create a variable a = pd.Series([ 100, 200, 300, 400])

In [2]:
a = pd.Series([100,200,300,400])

Print a, and data type

In [3]:
print(a)
print("Data type:", type(a))

0    100
1    200
2    300
3    400
dtype: int64
Data type: <class 'pandas.core.series.Series'>

Using indexing access the element 300 from the series a.

In [4]:
element = a[2]
print(element)

300

What are the values of index for series a?

In [5]:

print(a.index)

RangeIndex(start=0, stop=4, step=1)

Change the index to  ['c', 'a', 'b', 'd']

In [6]:
a = pd.Series([100, 200, 300, 400], index=['c', 'a', 'b', 'd'])
print(a)

c    100
a    200
b    300
d    400
dtype: int64

Access the value in the series with index 'd'

In [7]:
value = a['d']
print(value)

400

Sort the values wrt to the index and print it

In [8]:
sorted_a = a.sort_index()
print(sorted_a)

a    200
b    300
c    100
d    400
dtype: int64

Create a new Pandas Series b having index as 'e', 'f', and 'g' and value 800,450,100 and print it

In [9]:
b = pd.Series([800, 450, 100], index=['e', 'f', 'g'])
print(b)

e    800
f    450
g    100
dtype: int64

Append b series at the end of a series

In [10]:
combined = pd.concat([a, b]) # Use pd.concat instead of pd.append
print(combined)

c    100
a    200
b    300
d    400
e    800
f    450
g    100
dtype: int64

In [11]:
#print a again after appending b into it


print(a)

c    100
a    200
b    300
d    400
dtype: int64

Sort the values in descending order of a and print the index of the sorted series

In [12]:
# Sorting values in descending order
sorted_a = a.sort_values(ascending=False)

# Printing sorted series and its index
print(sorted_a)
print("\nIndex of sorted series:", sorted_a.index.tolist())

d    400
b    300
a    200
c    100
dtype: int64

Index of sorted series: ['d', 'b', 'a', 'c']

## Pandas DataFrame

### Part 1

Create a pandas dataframe df from the series 'a' that we used in the last section, print the dataframe

In [13]:
df = pd.DataFrame([100,200,300,400])

In [14]:
print(df)

     0
0  100
1  200
2  300
3  400

What is the shape of the datafarme <br>
(also, what does it imply?)

In [15]:
print(df.shape)

(4, 1)

Hey! remember shape (7,1) implies dataframe has 7 rows and 1 column.

What is the index of the dataframe, is it same as the series 'a'

In [16]:
# yep its same as the series.
print(df.index)

RangeIndex(start=0, stop=4, step=1)

print the head and tail of the dataframe. <br>
Additional - (what does head and tali represent?)

In [17]:
# Printing head (first few rows)
print("Head of DataFrame:")
print(df.head())

Head of DataFrame:
     0
0  100
1  200
2  300
3  400

In [18]:
# Printing tail (last few rows)
print("\nTail of DataFrame:")
print(df.tail())

Tail of DataFrame:
     0
0  100
1  200
2  300
3  400

Rename the column of the dataframe as 'points'

In [19]:

# Renaming the column to 'points'
df.columns = ['points']

# Printing the updated DataFrame
print(df)

   points
0     100
1     200
2     300
3     400

Create another Series 'fruits', which contains random names of fruits from ['orange','mango','apple']. The series should contain 7 elements, randomly selected from ['orange','mango','apple']

In [20]:
#Create fruits array

# Define the list of fruit choices
fruit_choices = ['orange', 'mango', 'apple']

# Create the fruits array with 7 random selections
fruits_array = np.random.choice(fruit_choices, size=7)

In [21]:
#Create series fruits out of fruits array
fruits = pd.Series(fruits_array)
# Print the Series
print(fruits)

0     mango
1    orange
2     mango
3    orange
4     apple
5     apple
6     apple
dtype: object

Change the index of fruits to the index of dataframe df

In [22]:
# Creating the fruits array with 4 random values
fruit_choices = ['orange', 'mango', 'apple']
fruits_array = np.random.choice(fruit_choices, size=df.shape[0])  # Ensure same size as df

# Creating the Series with the same index as df
fruits = pd.Series(fruits_array, index=df.index)

# Printing the updated Series
print(fruits)

0    orange
1     mango
2     mango
3     mango
dtype: object

Add this fruits series as a new column to the dataframe df with its column name as 'fruits'
<br>print the head of the dataframe to verify

In [23]:
# Adding the fruits Series as a new column
df['fruits'] = fruits

# Printing the head of the updated DataFrame
print(df.head())

   points  fruits
0     100  orange
1     200   mango
2     300   mango
3     400   mango

## Pandas Concatenation

Create a dataframe  d1 where the cols are  ‘city’ : [‘Chandigarh’, ‘Delhi’, ‘Kanpur’, ‘Chennai’, ‘Manali’ ] and ‘Temperature’ : [15, 22, 20, 26,-2]

In [24]:
d1 = pd.DataFrame({
    'city': ['Chandigarh', 'Delhi', 'Kanpur', 'Chennai', 'Manali'],
    'Temperature': [15, 22, 20, 26, -2]
})

Print(d1)

In [25]:

print(d1)

         city  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20
3     Chennai           26
4      Manali           -2

What is the shape of d1.

In [26]:
print(d1.shape)

(5, 2)

Set city = d1['city']

In [27]:
city = d1['city']
print(city)

0    Chandigarh
1         Delhi
2        Kanpur
3       Chennai
4        Manali
Name: city, dtype: object

print city <br>
What is the type of city.

In [28]:
print(type(city))

<class 'pandas.core.series.Series'>

Create another datafeame 'd2' where the columns are <br>
'city' - ['Bengalaru','Coimbatore','Srirangam','Pondicherry'] <br>
'Temperature' - [24,35,36,39]

In [29]:
# Creating the DataFrame d2
d2 = pd.DataFrame({
    'city': ['Bengalaru', 'Coimbatore', 'Srirangam', 'Pondicherry'],
    'Temperature': [24, 35, 36, 39]
})

# Printing the DataFrame
print(d2)

          city  Temperature
0    Bengalaru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

print the shape of this dataframe

In [30]:
print(d2.shape)

(4, 2)

merge the two dataframes together, save it in a new dataframe named 'd3'

In [31]:
# Merging d1 and d2
d3 = pd.concat([d1, d2], ignore_index=True)

# Printing the new dataframe
print(d3)

          city  Temperature
0   Chandigarh           15
1        Delhi           22
2       Kanpur           20
3      Chennai           26
4       Manali           -2
5    Bengalaru           24
6   Coimbatore           35
7    Srirangam           36
8  Pondicherry           39

Select the part of the dataframe such that it contains cities wherer temp is less then or equal to 20 <br>
How many cities are there?

In [32]:
# Filtering cities where Temperature is ≤ 20
cold_cities = d3[d3['Temperature'] <= 20]

# Printing the filtered DataFrame
print(cold_cities)

# Printing the number of cities
print("\nNumber of cities:", cold_cities.shape[0])

         city  Temperature
0  Chandigarh           15
2      Kanpur           20
4      Manali           -2

Number of cities: 3

Select the part of the dataframe such that it contains the cities where tempearature greater than or equal to 35

In [33]:
# Filtering cities where Temperature is ≥ 35
hot_cities = d3[d3['Temperature'] >= 35]

# Printing the filtered DataFrame
print(hot_cities)

# Printing the number of cities
print("\nNumber of cities:", hot_cities.shape[0])

          city  Temperature
6   Coimbatore           35
7    Srirangam           36
8  Pondicherry           39

Number of cities: 3

**bold text**## Applying functions to columns and creating new columns

We need to create another column in d3, which contains  a boolean value for each city to indicate whether it's a union territory or not.
- HINT: Chandigarh, Pondicherry and Delhi are only 3 union territories here.

In [34]:
# Function to check if a city is a union territory
def is_ut(x):
    # List of union territories
    ut_cities = ['Chandigarh', 'Pondicherry', 'Delhi']
    return x in ut_cities  # Returns True if city is in the list, else False

# Adding the new column 'is_ut' to d3
d3['is_ut'] = d3['city'].apply(is_ut)

In [35]:
# print d3
print(d3)

          city  Temperature  is_ut
0   Chandigarh           15   True
1        Delhi           22   True
2       Kanpur           20  False
3      Chennai           26  False
4       Manali           -2  False
5    Bengalaru           24  False
6   Coimbatore           35  False
7    Srirangam           36  False
8  Pondicherry           39   True

The temperatures mentioned in ‘Temperature’ column are mentioned in Celsius, we need another column which contains the same in Fahrenheit.

HINT -
- Define a function c_to_f which takes input temp in celsius and returns a value with temperature in Fahrenheit.
- To check: c_to_f(10) should return 50.

In [36]:
# write function here
# Function to convert Celsius to Fahrenheit
def c_to_f(celsius):
    return (celsius * 9/5) + 32

In [37]:
# Checking the function
print(c_to_f(10))  # Expected output: 50

50.0

In [38]:
# apply function c_to_f to d3 to create a column 'temp_farenhiet'

# Applying c_to_f function to create a new column 'temp_fahrenheit'
d3['temp_fahrenheit'] = d3['Temperature'].apply(c_to_f)

# Printing the updated DataFrame
print(d3)

          city  Temperature  is_ut  temp_fahrenheit
0   Chandigarh           15   True             59.0
1        Delhi           22   True             71.6
2       Kanpur           20  False             68.0
3      Chennai           26  False             78.8
4       Manali           -2  False             28.4
5    Bengalaru           24  False             75.2
6   Coimbatore           35  False             95.0
7    Srirangam           36  False             96.8
8  Pondicherry           39   True            102.2

## Indexing and selecting rows in DataFrame

Select subset of the dataframe d1 such that it contains the cities which are union territories.

In [47]:

ut_cities = ['Chandigarh', 'Pondicherry', 'Delhi']

# Filtering d1 to include only union territories
d1_ut = d1[d1['city'].isin(ut_cities)]

# Printing the filtered DataFrame
print(d1_ut)

         city  Temperature
0  Chandigarh           15
1       Delhi           22

Select a subset of the dataframe d1 such that it contains the cities which only have temperature above 90 Farenhiet.

In [48]:
# Function to convert Celsius to Fahrenheit
def c_to_f(celsius):
    return (celsius * 9/5) + 32

# Filtering cities with temperature > 90°F
d1_hot = d1[d1['Temperature'].apply(c_to_f) > 90]

# Printing the filtered DataFrame
print(d1_hot)

Empty DataFrame
Columns: [city, Temperature]
Index: []

Select only the first three rows of the dataframe d1.

In [49]:
# Selecting the first three rows
d1_first_three = d1.iloc[:3]  # or d1.head(3)

# Printing the result
print(d1_first_three)

         city  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20

Select all the rows and last two columns in the dataframe.

In [50]:
# Selecting all rows and last two columns
d1_last_two_cols = d1.iloc[:, -2:]

# Printing the result
print(d1_last_two_cols)

         city  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20
3     Chennai           26
4      Manali           -2

## Groupby

In [51]:
# Create a dataframe using dictionary of your choice
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [25, 30, 35, 40, 22],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Miami'],
    'Score': [85, 90, 88, 76, 95]
}

# Creating the DataFrame
df = pd.DataFrame(data)

# Printing the DataFrame
print(df)

      Name  Age         City  Score
0    Alice   25     New York     85
1      Bob   30  Los Angeles     90
2  Charlie   35      Chicago     88
3    David   40      Houston     76
4      Eve   22        Miami     95

In [52]:
# Use Groupby of single column with aggregate sum()
data = {
    'Department': ['HR', 'IT', 'HR', 'IT', 'Finance', 'Finance', 'HR'],
    'Salary': [50000, 70000, 55000, 80000, 60000, 65000, 52000]
}

df = pd.DataFrame(data)

# Grouping by 'Department' and summing the 'Salary' column
grouped_df = df.groupby('Department')['Salary'].sum()

# Printing the result
print(grouped_df)

Department
Finance    125000
HR         157000
IT         150000
Name: Salary, dtype: int64

In [54]:
# Use Groupby of single column with aggregate count()
data = {
    'Department': ['HR', 'IT', 'HR', 'IT', 'Finance', 'Finance', 'HR'],
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Grace']
}

df = pd.DataFrame(data)

# Grouping by 'Department' and counting the number of employees
grouped_df = df.groupby('Department')['Employee'].count()

# Printing the result
print(grouped_df)

Department
Finance    2
HR         3
IT         2
Name: Employee, dtype: int64

In [55]:
# Use Groupby of single column with aggregate min() and max()
data = {
    'Department': ['HR', 'IT', 'HR', 'IT', 'Finance', 'Finance', 'HR'],
    'Salary': [50000, 70000, 55000, 80000, 60000, 65000, 52000]
}

df = pd.DataFrame(data)

# Grouping by 'Department' and applying min() and max()
grouped_df = df.groupby('Department')['Salary'].agg(['min', 'max'])

# Printing the result
print(grouped_df)

              min    max
Department
Finance     60000  65000
HR          50000  55000
IT          70000  80000

In [56]:
# Use Groupby of any 2 columns with aggregate mean()
# Sample DataFrame
data = {
    'Department': ['HR', 'IT', 'HR', 'IT', 'Finance', 'Finance', 'HR', 'IT', 'Finance'],
    'Location': ['NY', 'CA', 'NY', 'TX', 'CA', 'TX', 'NY', 'CA', 'TX'],
    'Salary': [50000, 70000, 55000, 80000, 60000, 65000, 52000, 75000, 63000]
}

df = pd.DataFrame(data)

# Grouping by 'Department' and 'Location' and calculating the mean salary
grouped_df = df.groupby(['Department', 'Location'])['Salary'].mean()

# Printing the result
print(grouped_df)

Department  Location
Finance     CA          60000.000000
            TX          64000.000000
HR          NY          52333.333333
IT          CA          72500.000000
            TX          80000.000000
Name: Salary, dtype: float64

In [57]:
# Use Groupby of any 2 columns with aggregate min() and max()
# Sample DataFrame
data = {
    'Department': ['HR', 'IT', 'HR', 'IT', 'Finance', 'Finance', 'HR', 'IT', 'Finance'],
    'Location': ['NY', 'CA', 'NY', 'TX', 'CA', 'TX', 'NY', 'CA', 'TX'],
    'Salary': [50000, 70000, 55000, 80000, 60000, 65000, 52000, 75000, 63000]
}

df = pd.DataFrame(data)

# Grouping by 'Department' and 'Location' and applying min() and max()
grouped_df = df.groupby(['Department', 'Location'])['Salary'].agg(['min', 'max'])

# Printing the result
print(grouped_df)

                       min    max
Department Location
Finance    CA        60000  60000
           TX        63000  65000
HR         NY        50000  55000
IT         CA        70000  75000
           TX        80000  80000

## Data Range

Create a pandas daterange where starting date is 1st of January,2020 and end date is 1st of April 2021, store it in a new variable named 'a'

In [59]:
# Creating a date range from Jan 1, 2020, to April 1, 2021
a = pd.date_range(start='2020-01-01', end='2021-04-01', freq='D')

print a

In [60]:
# Printing the first few dates
print(a)

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10',
               ...
               '2021-03-23', '2021-03-24', '2021-03-25', '2021-03-26',
               '2021-03-27', '2021-03-28', '2021-03-29', '2021-03-30',
               '2021-03-31', '2021-04-01'],
              dtype='datetime64[ns]', length=457, freq='D')

What is the len of a?

In [61]:
print(len(a))

457

What is the type of a?

In [62]:

print(type(a))

<class 'pandas.core.indexes.datetimes.DatetimeIndex'>